{"<pad>": 0, "<sos>": 1, "<eos>": 2, "<unk>": 3, "<mask>": 4, "[S@@]": 5, "/": 6, "[CH3-]": 7, "[Sb+]": 8, "[Eu]": 9, "[123I]": 10, "[Tb+3]": 11, "[N@H+]": 12, "[AlH]": 13, "[N@@H+]": 14, "[C-2]": 15, "[Ir+4]": 16, "[R1]": 17, "[R7]": 18, "[ClH2+]": 19, "[IrH2]": 20, "[Ta]": 21, "[Ta+5]": 22, "[Ra]": 23, "[Zn+2]": 24, "[14cH]": 25, "[C+4]": 26, "[CO2H]": 27, "[15n]": 28, "[Br]": 29, "[PH3+]": 30, "[S@+]": 31, "[SO3H]": 32, "[18OH2]": 33, "[R9]": 34, "[Rc]": 35, "[V]": 36, "[Si@H]": 37, "[3H]": 38, "[Cd+2]": 39, "[MgH]": 40, "[Ru+]": 41, "[OH-]": 42, "s": 43, "[Nb]": 44, "[SnH2]": 45, "[13cH]": 46, "[2NH]": 47, "[P+2]": 48, "[35S]": 49, "[N+2]": 50, "[BH2-]": 51, "[Rh+4]": 52, "P": 53, "%13": 54, "[V+5]": 55, "[S+2]": 56, "%10": 57, "[BaH2]": 58, "[Pd+]": 59, "[Ho+3]": 60, "[15nH]": 61, "[P-]": 62, "[Cl]": 63, "[Rd]": 64, "[N@@]": 65, "[Sn+4]": 66, "[sH+]": 67, "[NiH]": 68, "[TeH2]": 69, "[As+3]": 70, "[Si+2]": 71, "[SH2]": 72, "[Sr+2]": 73, "[124I]": 74, "[KH]": 75, "[Mo+6]": 76, "[C+]": 77, "5": 78, "[OiBu]": 79, "[32P]": 80, "[Mo]": 81, "[Ar]": 82, "[EtO]": 83, "[Mn]": 84, "[BH2]": 85, "[Se-]": 86, "[CH]": 87, "[SH-]": 88, "[U+6]": 89, "n": 90, "[15NH2]": 91, "[Sn]": 92, "[BH4-]": 93, "%14": 94, "[9CH]": 95, "[Rh+3]": 96, "[O]": 97, "[Ac]": 98, "[Co+3]": 99, "[Sm+3]": 100, "[Er+3]": 101, "[15N]": 102, "[Re]": 103, "[Ir+2]": 104, "[P@@]": 105, "[SiH4]": 106, "[Cr+2]": 107, "[NCF3]": 108, "[Sb]": 109, "[Pd+2]": 110, "[19F]": 111, "=": 112, "[nH]": 113, "[N+3]": 114, "[C@H]": 115, "[NMe]": 116, "[o+]": 117, "[Ti+5]": 118, "[Pd-2]": 119, "[B+2]": 120, "[P+]": 121, "4": 122, "[18F]": 123, "[R]": 124, "[7NaH]": 125, "[SnH4]": 126, "%22": 127, "[R11]": 128, "[C@]": 129, "[TBS]": 130, "[13c]": 131, "[Al+3]": 132, "[B+]": 133, "[24NaH]": 134, "[CF3]": 135, "[Zn+]": 136, "[Rh-]": 137, "[Cbz]": 138, "[Dy+3]": 139, "[Suc]": 140, "[Ac-]": 141, "[Mn+4]": 142, "[P@@H]": 143, "[Ti+6]": 144, "[Zr+]": 145, "[Cu-]": 146, "[PtH+2]": 147, "[229Th]": 148, "[NH+]": 149, "[Al+]": 150, "%23": 151, "[GeH]": 152, "[Os+4]": 153, "[Sn+2]": 154, "[P+3]": 155, "[NH3+]": 156, "[GeH2]": 157, "[MeS]": 158, "[Pr]": 159, "[Bn]": 160, "[Ce+2]": 161, "[Pd+4]": 162, "[OEt]": 163, "[Tc]": 164, "[14CH3]": 165, "%19": 166, "[OH+]": 167, "[13CH2]": 168, "[Ph]": 169, "[18F-]": 170, "[C-4]": 171, "[Si-]": 172, "p": 173, "[15CH]": 174, "[Al-]": 175, "c": 176, ")": 177, "[Pr+3]": 178, "[Pt-]": 179, "[BaH]": 180, "[IrH]": 181, "[Ba+]": 182, "[153Sm]": 183, "[Na+]": 184, "[PH+]": 185, "[AsH4+]": 186, "[I+3]": 187, "[PH5]": 188, "[S+]": 189, "[Sm+2]": 190, "%18": 191, "6": 192, "[Xe+]": 193, "[B]": 194, "*": 195, "[Cy]": 196, "[14CH]": 197, "[Gd]": 198, "[MeN]": 199, "[Ca+]": 200, "[Fe+4]": 201, "[CCl3]": 202, "3": 203, "%11": 204, "[Tb]": 205, "[Ho]": 206, "[CO2Et]": 207, "[Ni+3]": 208, "[n-]": 209, "[Mn+2]": 210, "[Ti+3]": 211, "[Ru-2]": 212, "[Nb+3]": 213, "[Hg+]": 214, "[D]": 215, "[Bi+5]": 216, "[Gd+3]": 217, "[125I]": 218, "[Pb+3]": 219, ">>": 220, "[AlH2+]": 221, "%24": 222, "[Si@@]": 223, "[Cl+3]": 224, "[14c]": 225, "[Sr]": 226, "[Ba]": 227, "[Li]": 228, "[Be]": 229, "[PH3]": 230, "1": 231, "#": 232, "[2H]": 233, "[NH]": 234, "[RuH2]": 235, "[Cu+3]": 236, "[9CH3]": 237, "-": 238, "[Cs]": 239, "[CaH2]": 240, "[Ag-]": 241, "[Mo+2]": 242, "[s+]": 243, "[Si@@H]": 244, "[Si+4]": 245, "[S@@+]": 246, "[Pb+2]": 247, "[NO2]": 248, "[F3C]": 249, "[Zn]": 250, "[F]": 251, "[Cr]": 252, "[1H]": 253, "[Cr+4]": 254, "[Pt+4]": 255, "[Er]": 256, "[I]": 257, "[SeH-]": 258, "[Fm]": 259, "[P-3]": 260, "[Re+4]": 261, "[SnH3]": 262, "[se]": 263, "[Nb+5]": 264, "[IH]": 265, "[In+3]": 266, "[Ti+2]": 267, "[PH4+]": 268, "Br": 269, "[SnH]": 270, "[SH3+]": 271, "[AlH4]": 272, "[15NH]": 273, "[NH2+]": 274, "[Hf+3]": 275, "[Hf+4]": 276, "[As]": 277, "[OBz]": 278, "[Ir-]": 279, "[Cr+3]": 280, "[TeH3]": 281, "[Ce+3]": 282, "[Z]": 283, "[Ru-]": 284, "[Pb+4]": 285, "[31P]": 286, "[U]": 287, "[Ba+2]": 288, "%16": 289, "[S+4]": 290, "[Cd+]": 291, "[NH2]": 292, "[10B]": 293, "[I+2]": 294, "[te]": 295, ".": 296, "[VH]": 297, "[In+2]": 298, "[R10]": 299, "[pH]": 300, "[PH4]": 301, "[S-2]": 302, "[I-]": 303, "[Hg+2]": 304, "[CH+]": 305, "[Ts]": 306, "[Zr]": 307, "[LaH]": 308, "[Na-]": 309, "[OtBu]": 310, "[O-]": 311, "O": 312, "[68Ga]": 313, "[p-]": 314, "[N-3]": 315, "[Pt-2]": 316, "[HeH]": 317, "[Ti+]": 318, "[NHBoc]": 319, "[Bu]": 320, "[N]": 321, "[Th]": 322, "[Bz]": 323, "[TBZ]": 324, "[H+]": 325, "[Nd+]": 326, "[Yb]": 327, "[Xe]": 328, "[C@@]": 329, "[Si+]": 330, "[siH]": 331, "[Bi+]": 332, "[Pd-]": 333, "S": 334, "[CuH2-]": 335, "[Fr]": 336, "[UH]": 337, "[Pd+3]": 338, "[Hf+2]": 339, "[H]": 340, "[Pt+2]": 341, "[Dy]": 342, "I": 343, "[P@]": 344, "o": 345, "9": 346, "[Ti]": 347, "[OHC]": 348, "[Cn]": 349, "[14C]": 350, "[iPr]": 351, "[F+]": 352, "[NH+3]": 353, "[AsH+]": 354, "[Tl+3]": 355, "[Hg]": 356, "[OMe]": 357, "[N-]": 358, "[Nd+3]": 359, "[SH2+]": 360, "[Co+]": 361, "[Hf]": 362, "[CHO]": 363, "[S]": 364, "%17": 365, "%21": 366, "[ClH+]": 367, "[14C@H]": 368, "[NiH2]": 369, "[S@]": 370, "[nBu]": 371, "\\": 372, "[CH2]": 373, "[nPr]": 374, "[La+3]": 375, "[COOH]": 376, "[13C]": 377, "[CH-]": 378, "[TFA]": 379, "C": 380, "[Fe+2]": 381, "[As-]": 382, "[Os]": 383, "[Ir]": 384, "[BH-]": 385, "[Al+2]": 386, "Cl": 387, "[Au+3]": 388, "[Sb+3]": 389, "[Si]": 390, "[E]": 391, "[Fe-3]": 392, "[Cl+2]": 393, "[SiH]": 394, "[Cr+]": 395, "[Ga+]": 396, "[TeH]": 397, "[R4]": 398, "[Mn+6]": 399, "[c-]": 400, "[YH]": 401, "[Zr+4]": 402, "[Tl+]": 403, "[Al]": 404, "[14CH2]": 405, "[OBn]": 406, "[AcH]": 407, "[67Ga+3]": 408, "[Ru+2]": 409, "[13C@H]": 410, "[13N]": 411, "[CH2-]": 412, "[Sn+]": 413, "[SMe]": 414, "[15OH2]": 415, "[Rh]": 416, "[Rh-3]": 417, "[Cf]": 418, "[SbH]": 419, "[V+2]": 420, "[Co]": 421, "[Cu+]": 422, "[se+]": 423, "[Ir+]": 424, "[AsH]": 425, "[Sn+3]": 426, "[Ir+3]": 427, "[Rb+]": 428, "[U+2]": 429, "[O2N]": 430, "%15": 431, "[O+]": 432, "[Ni-]": 433, "[Au+]": 434, "[ArH]": 435, "[Be+2]": 436, "[Nb+4]": 437, "[Pb]": 438, "[SeH2]": 439, "[IH+]": 440, "[64Cu]": 441, "[211At]": 442, "[Cd]": 443, "[Sc]": 444, "[Y]": 445, "[c+]": 446, "[N+]": 447, "[Ag+]": 448, "[Y-]": 449, "[C@@H]": 450, "[PH2+]": 451, "[In]": 452, "[Y+3]": 453, "[GeH3]": 454, "[NH4+]": 455, "[C-]": 456, "[SiH2]": 457, "[MeO]": 458, "[18O]": 459, "[Cs+]": 460, "[n+]": 461, "[Cr-]": 462, "[AlH2-]": 463, "[Rh+2]": 464, "[Fe]": 465, "[BrH+]": 466, "[AsH2]": 467, "[W+]": 468, "[CH2+]": 469, "[PH-]": 470, "[Co+2]": 471, "[X]": 472, "[AlH2]": 473, "[Cm]": 474, "[11c]": 475, "[Mes]": 476, "[Se]": 477, "[Bi]": 478, "[18OH]": 479, "[SiH3]": 480, "[ZrH2]": 481, "[Se+]": 482, "[Sm]": 483, "[P]": 484, "[Sc+3]": 485, "[Cl-]": 486, "[Cbm]": 487, "8": 488, "[124I-]": 489, "[Lu]": 490, "[S-]": 491, "b": 492, "[Ni]": 493, "[Ru]": 494, "[V+4]": 495, "[SeH]": 496, "[Tl+2]": 497, "[Br-]": 498, "[N@]": 499, "[N@+]": 500, "[13C@@H]": 501, "[R6]": 502, "[Te]": 503, "[Br+2]": 504, "[Bi+3]": 505, "2": 506, "[AlH3]": 507, "[cH-]": 508, "[SbH2]": 509, "[F-]": 510, "[Fe+6]": 511, "[Cu]": 512, "[V+3]": 513, "[Mg+]": 514, "[AlH4-]": 515, "[RuH]": 516, "[COOEt]": 517, "[Et]": 518, "[Re+5]": 519, "[R2]": 520, "[Th+4]": 521, "[Yb+3]": 522, "[CH3]": 523, "N": 524, "[Mg+2]": 525, "[NaH]": 526, "B": 527, "[118Sn]": 528, "[SH+]": 529, "[AsH3]": 530, "[Sb-]": 531, "[Sc+2]": 532, "[IH-]": 533, "[TMS]": 534, "[SiH4+]": 535, "[A]": 536, "[Rf]": 537, "[R5]": 538, "[Cr+6]": 539, "[LiH]": 540, "[Cu-2]": 541, "[Bi+2]": 542, "%20": 543, "[Ga]": 544, "[nH+]": 545, "[B+3]": 546, "[Ag+2]": 547, "[Yb+2]": 548, "[Ms]": 549, "[99Tc]": 550, "[Nd]": 551, "~": 552, "[Ce]": 553, "[Li-]": 554, "[Na]": 555, "[123I-]": 556, "[TaH3]": 557, "[B-]": 558, "[Eu+3]": 559, "[In+]": 560, "[11CH3]": 561, "[c]": 562, "[Na-2]": 563, "[Sb+2]": 564, "[Fmoc]": 565, "[OH]": 566, "[Zr-2]": 567, "[OAc]": 568, "[Py]": 569, "[Pd]": 570, "[Mo+4]": 571, "[13CH3]": 572, "[W+4]": 573, "[Mn+3]": 574, "[CN]": 575, "[tBu]": 576, "[Ag]": 577, "[BH]": 578, "[Ni+2]": 579, "[Zr+2]": 580, "[AlH-]": 581, "[131I]": 582, "[R3]": 583, "[Tl]": 584, "[Si@]": 585, "[Zr+3]": 586, "[H-]": 587, "[OH2+]": 588, "[iBu]": 589, "[CuH2]": 590, "7": 591, "[67Ga]": 592, "[Os-2]": 593, "[SH]": 594, "[OCH3]": 595, "[11C]": 596, "[cH+]": 597, "[Boc]": 598, "[PdH2]": 599, "[Rh+]": 600, "[BiH3]": 601, "[NH-]": 602, "[Mg]": 603, "[Ru+3]": 604, "[N@@+]": 605, "[W+6]": 606, "[PH]": 607, "[PH2]": 608, "[Br+]": 609, "[NHAc]": 610, "[IH2+]": 611, "[NBoc]": 612, "[Ti+4]": 613, "[K]": 614, "[C]": 615, "[Ga+3]": 616, "[Ni+]": 617, "[Cu+2]": 618, "[Fe-4]": 619, "[NH2-]": 620, "[Sb+5]": 621, "[Ag+3]": 622, "[Ca+2]": 623, "[K+]": 624, "[As+]": 625, "[NH3+2]": 626, "[Rb]": 627, "[I+]": 628, "[Au-]": 629, "[SeH+]": 630, "%12": 631, "[OTf]": 632, "[Pt]": 633, "[OH3+]": 634, "[60Co]": 635, "[FH+2]": 636, "[Au]": 637, "[Me]": 638, "[O-2]": 639, "[Ca]": 640, "[Fe+3]": 641, "[At]": 642, "F": 643, "[Ce+4]": 644, "[Tf]": 645, "[P@H]": 646, "[R12]": 647, "[BH3-]": 648, "[R8]": 649, "[OMs]": 650, "[Ge]": 651, "[Os+2]": 652, "[SH5]": 653, "(": 654, "[W]": 655, "[Cl+]": 656, "[13CH]": 657, "[La]": 658, "[Mn+]": 659, "[CH3+]": 660}