{"<pad>": 0, "<sos>": 1, "<eos>": 2, "<unk>": 3, "#": 4, "%10": 5, "%11": 6, "%12": 7, "%13": 8, "%14": 9, "%15": 10, "%16": 11, "%17": 12, "%18": 13, "%19": 14, "%20": 15, "%21": 16, "%22": 17, "%23": 18, "%24": 19, "(": 20, ")": 21, "*": 22, "-": 23, ".": 24, "/": 25, "1": 26, "2": 27, "3": 28, "4": 29, "5": 30, "6": 31, "7": 32, "8": 33, "9": 34, "=": 35, ">>": 36, "B": 37, "Br": 38, "C": 39, "Cl": 40, "F": 41, "I": 42, "N": 43, "O": 44, "P": 45, "S": 46, "[10B]": 47, "[118Sn]": 48, "[11CH3]": 49, "[11C]": 50, "[11c]": 51, "[123I-]": 52, "[123I]": 53, "[124I-]": 54, "[124I]": 55, "[125I]": 56, "[131I]": 57, "[13C@@H]": 58, "[13C@H]": 59, "[13CH2]": 60, "[13CH3]": 61, "[13CH]": 62, "[13C]": 63, "[13N]": 64, "[13cH]": 65, "[13c]": 66, "[14C@H]": 67, "[14CH2]": 68, "[14CH3]": 69, "[14CH]": 70, "[14C]": 71, "[14cH]": 72, "[14c]": 73, "[153Sm]": 74, "[15CH]": 75, "[15NH2]": 76, "[15NH]": 77, "[15N]": 78, "[15OH2]": 79, "[15nH]": 80, "[15n]": 81, "[18F-]": 82, "[18F]": 83, "[18OH2]": 84, "[18OH]": 85, "[18O]": 86, "[19F]": 87, "[1H]": 88, "[211At]": 89, "[229Th]": 90, "[24NaH]": 91, "[2H]": 92, "[2NH]": 93, "[31P]": 94, "[32P]": 95, "[35S]": 96, "[3H]": 97, "[60Co]": 98, "[64Cu]": 99, "[67Ga+3]": 100, "[67Ga]": 101, "[68Ga]": 102, "[7NaH]": 103, "[99Tc]": 104, "[9CH3]": 105, "[9CH]": 106, "[Ac-]": 107, "[AcH]": 108, "[Ac]": 109, "[Ag+2]": 110, "[Ag+3]": 111, "[Ag+]": 112, "[Ag-]": 113, "[Ag]": 114, "[Al+2]": 115, "[Al+3]": 116, "[Al+]": 117, "[Al-]": 118, "[AlH-]": 119, "[AlH2+]": 120, "[AlH2-]": 121, "[AlH2]": 122, "[AlH3]": 123, "[AlH4-]": 124, "[AlH4]": 125, "[AlH]": 126, "[Al]": 127, "[ArH]": 128, "[Ar]": 129, "[As+3]": 130, "[As+]": 131, "[As-]": 132, "[AsH+]": 133, "[AsH2]": 134, "[AsH3]": 135, "[AsH4+]": 136, "[AsH]": 137, "[As]": 138, "[At]": 139, "[Au+3]": 140, "[Au+]": 141, "[Au-]": 142, "[Au]": 143, "[B+2]": 144, "[B+3]": 145, "[B+]": 146, "[B-]": 147, "[BH-]": 148, "[BH2-]": 149, "[BH2]": 150, "[BH3-]": 151, "[BH4-]": 152, "[BH]": 153, "[B]": 154, "[Ba+2]": 155, "[Ba+]": 156, "[BaH2]": 157, "[BaH]": 158, "[Ba]": 159, "[Be+2]": 160, "[Be]": 161, "[Bi+2]": 162, "[Bi+3]": 163, "[Bi+5]": 164, "[Bi+]": 165, "[BiH3]": 166, "[Bi]": 167, "[Br+2]": 168, "[Br+]": 169, "[Br-]": 170, "[BrH+]": 171, "[Br]": 172, "[C+4]": 173, "[C+]": 174, "[C-2]": 175, "[C-4]": 176, "[C-]": 177, "[C@@H]": 178, "[C@@]": 179, "[C@H]": 180, "[C@]": 181, "[CH+]": 182, "[CH-]": 183, "[CH2+]": 184, "[CH2-]": 185, "[CH2]": 186, "[CH3+]": 187, "[CH3-]": 188, "[CH3]": 189, "[CH]": 190, "[C]": 191, "[Ca+2]": 192, "[Ca+]": 193, "[CaH2]": 194, "[Ca]": 195, "[Cd+2]": 196, "[Cd+]": 197, "[Cd]": 198, "[Ce+2]": 199, "[Ce+3]": 200, "[Ce+4]": 201, "[Ce]": 202, "[Cf]": 203, "[Cl+2]": 204, "[Cl+3]": 205, "[Cl+]": 206, "[Cl-]": 207, "[ClH+]": 208, "[ClH2+]": 209, "[Cl]": 210, "[Cm]": 211, "[Cn]": 212, "[Co+2]": 213, "[Co+3]": 214, "[Co+]": 215, "[Co]": 216, "[Cr+2]": 217, "[Cr+3]": 218, "[Cr+4]": 219, "[Cr+6]": 220, "[Cr+]": 221, "[Cr-]": 222, "[Cr]": 223, "[Cs+]": 224, "[Cs]": 225, "[Cu+2]": 226, "[Cu+3]": 227, "[Cu+]": 228, "[Cu-2]": 229, "[Cu-]": 230, "[CuH2-]": 231, "[CuH2]": 232, "[Cu]": 233, "[Dy+3]": 234, "[Dy]": 235, "[Er+3]": 236, "[Er]": 237, "[Eu+3]": 238, "[Eu]": 239, "[F+]": 240, "[F-]": 241, "[FH+2]": 242, "[F]": 243, "[Fe+2]": 244, "[Fe+3]": 245, "[Fe+4]": 246, "[Fe+6]": 247, "[Fe-3]": 248, "[Fe-4]": 249, "[Fe]": 250, "[Fm]": 251, "[Fr]": 252, "[Ga+3]": 253, "[Ga+]": 254, "[Ga]": 255, "[Gd+3]": 256, "[Gd]": 257, "[GeH2]": 258, "[GeH3]": 259, "[GeH]": 260, "[Ge]": 261, "[H+]": 262, "[H-]": 263, "[H]": 264, "[HeH]": 265, "[Hf+2]": 266, "[Hf+3]": 267, "[Hf+4]": 268, "[Hf]": 269, "[Hg+2]": 270, "[Hg+]": 271, "[Hg]": 272, "[Ho+3]": 273, "[Ho]": 274, "[I+2]": 275, "[I+3]": 276, "[I+]": 277, "[I-]": 278, "[IH+]": 279, "[IH-]": 280, "[IH2+]": 281, "[IH]": 282, "[I]": 283, "[In+2]": 284, "[In+3]": 285, "[In+]": 286, "[In]": 287, "[Ir+2]": 288, "[Ir+3]": 289, "[Ir+4]": 290, "[Ir+]": 291, "[Ir-]": 292, "[IrH2]": 293, "[IrH]": 294, "[Ir]": 295, "[K+]": 296, "[KH]": 297, "[K]": 298, "[La+3]": 299, "[LaH]": 300, "[La]": 301, "[Li+]": 302, "[Li-]": 303, "[LiH]": 304, "[Li]": 305, "[Lu]": 306, "[Mg+2]": 307, "[Mg+]": 308, "[MgH]": 309, "[Mg]": 310, "[Mn+2]": 311, "[Mn+3]": 312, "[Mn+4]": 313, "[Mn+6]": 314, "[Mn+]": 315, "[Mn]": 316, "[Mo+2]": 317, "[Mo+4]": 318, "[Mo+6]": 319, "[Mo]": 320, "[N+2]": 321, "[N+3]": 322, "[N+]": 323, "[N-3]": 324, "[N-]": 325, "[N@+]": 326, "[N@@+]": 327, "[N@@H+]": 328, "[N@@]": 329, "[N@H+]": 330, "[N@]": 331, "[NH+3]": 332, "[NH+]": 333, "[NH-]": 334, "[NH2+]": 335, "[NH2-]": 336, "[NH2]": 337, "[NH3+2]": 338, "[NH3+]": 339, "[NH4+]": 340, "[NH]": 341, "[N]": 342, "[Na+]": 343, "[Na-2]": 344, "[Na-]": 345, "[NaH]": 346, "[Na]": 347, "[Nb+3]": 348, "[Nb+4]": 349, "[Nb+5]": 350, "[Nb]": 351, "[Nd+3]": 352, "[Nd+]": 353, "[Nd]": 354, "[Ni+2]": 355, "[Ni+3]": 356, "[Ni+]": 357, "[Ni-]": 358, "[NiH2]": 359, "[NiH]": 360, "[Ni]": 361, "[O+]": 362, "[O-2]": 363, "[O-]": 364, "[OH+]": 365, "[OH-]": 366, "[OH2+]": 367, "[OH3+]": 368, "[OH]": 369, "[O]": 370, "[Os+2]": 371, "[Os+4]": 372, "[Os-2]": 373, "[Os]": 374, "[P+2]": 375, "[P+3]": 376, "[P+]": 377, "[P-3]": 378, "[P-]": 379, "[P@@H]": 380, "[P@@]": 381, "[P@H]": 382, "[P@]": 383, "[PH+]": 384, "[PH-]": 385, "[PH2+]": 386, "[PH2]": 387, "[PH3+]": 388, "[PH3]": 389, "[PH4+]": 390, "[PH4]": 391, "[PH5]": 392, "[PH]": 393, "[P]": 394, "[Pb+2]": 395, "[Pb+3]": 396, "[Pb+4]": 397, "[Pb]": 398, "[Pd+2]": 399, "[Pd+3]": 400, "[Pd+4]": 401, "[Pd+]": 402, "[Pd-2]": 403, "[Pd-]": 404, "[PdH2]": 405, "[Pd]": 406, "[Pr+3]": 407, "[Pr]": 408, "[Pt+2]": 409, "[Pt+4]": 410, "[Pt-2]": 411, "[Pt-]": 412, "[PtH+2]": 413, "[Pt]": 414, "[R1]": 415, "[R2]": 416, "[R3]": 417, "[R4]": 418, "[R5]": 419, "[R]": 420, "[Rb+]": 421, "[Rb]": 422, "[Re+4]": 423, "[Re+5]": 424, "[Re]": 425, "[Rh+2]": 426, "[Rh+3]": 427, "[Rh+4]": 428, "[Rh+]": 429, "[Rh-3]": 430, "[Rh-]": 431, "[Rh]": 432, "[Ru+2]": 433, "[Ru+3]": 434, "[Ru+]": 435, "[Ru-2]": 436, "[Ru-]": 437, "[RuH2]": 438, "[RuH]": 439, "[Ru]": 440, "[S+2]": 441, "[S+4]": 442, "[S+]": 443, "[S-2]": 444, "[S-]": 445, "[S@+]": 446, "[S@@+]": 447, "[S@@]": 448, "[S@]": 449, "[SH+]": 450, "[SH-]": 451, "[SH2+]": 452, "[SH2]": 453, "[SH3+]": 454, "[SH5]": 455, "[SH]": 456, "[S]": 457, "[Sb+2]": 458, "[Sb+3]": 459, "[Sb+5]": 460, "[Sb+]": 461, "[Sb-]": 462, "[SbH2]": 463, "[SbH]": 464, "[Sb]": 465, "[Sc+2]": 466, "[Sc+3]": 467, "[Sc]": 468, "[Se+]": 469, "[Se-]": 470, "[SeH+]": 471, "[SeH-]": 472, "[SeH2]": 473, "[SeH]": 474, "[Se]": 475, "[Si+2]": 476, "[Si+4]": 477, "[Si+]": 478, "[Si-]": 479, "[Si@@H]": 480, "[Si@@]": 481, "[Si@H]": 482, "[Si@]": 483, "[SiH2]": 484, "[SiH3]": 485, "[SiH4+]": 486, "[SiH4]": 487, "[SiH]": 488, "[Si]": 489, "[Sm+2]": 490, "[Sm+3]": 491, "[Sm]": 492, "[Sn+2]": 493, "[Sn+3]": 494, "[Sn+4]": 495, "[Sn+]": 496, "[SnH2]": 497, "[SnH3]": 498, "[SnH4]": 499, "[SnH]": 500, "[Sn]": 501, "[Sr+2]": 502, "[Sr]": 503, "[Ta+5]": 504, "[TaH3]": 505, "[Ta]": 506, "[Tb+3]": 507, "[Tb]": 508, "[Tc]": 509, "[TeH2]": 510, "[TeH3]": 511, "[TeH]": 512, "[Te]": 513, "[Th+4]": 514, "[Th]": 515, "[Ti+2]": 516, "[Ti+3]": 517, "[Ti+4]": 518, "[Ti+5]": 519, "[Ti+6]": 520, "[Ti+]": 521, "[Ti]": 522, "[Tl+2]": 523, "[Tl+3]": 524, "[Tl+]": 525, "[Tl]": 526, "[U+2]": 527, "[U+6]": 528, "[UH]": 529, "[U]": 530, "[V+2]": 531, "[V+3]": 532, "[V+4]": 533, "[V+5]": 534, "[VH]": 535, "[V]": 536, "[W+4]": 537, "[W+6]": 538, "[W+]": 539, "[W]": 540, "[X]": 541, "[Xe+]": 542, "[Xe]": 543, "[Y+3]": 544, "[Y-]": 545, "[YH]": 546, "[Y]": 547, "[Yb+2]": 548, "[Yb+3]": 549, "[Yb]": 550, "[Zn+2]": 551, "[Zn+]": 552, "[Zn]": 553, "[Zr+2]": 554, "[Zr+3]": 555, "[Zr+4]": 556, "[Zr+]": 557, "[Zr-2]": 558, "[ZrH2]": 559, "[Zr]": 560, "[c+]": 561, "[c-]": 562, "[cH+]": 563, "[cH-]": 564, "[c]": 565, "[n+]": 566, "[n-]": 567, "[nH+]": 568, "[nH]": 569, "[o+]": 570, "[p-]": 571, "[pH]": 572, "[s+]": 573, "[sH+]": 574, "[se+]": 575, "[se]": 576, "[siH]": 577, "[te]": 578, "\\": 579, "b": 580, "c": 581, "n": 582, "o": 583, "p": 584, "s": 585, "~": 586}